lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaDimmableLightJoinable/ZigbeeHaDimmableLightJoinable.ino
  requestSecureRejoin();
  clearPendingApsAck();
  clearRecentInboundAps();
  if (g_rejoinPending) {
    persistState();
    Serial.print("mgmt_leave accepted rejoin\r\n");
    return;
  }

  Serial.print("mgmt_leave accepted rejoin_unavailable failure=");
  Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
  Serial.print("\r\n");
  clearJoinState(true);
}

void clearPendingApsAck() {
  memset(&g_pendingApsAck, 0, sizeof(g_pendingApsAck));
}

void clearRecentInboundAps() {
  memset(&g_recentInboundAps, 0, sizeof(g_recentInboundAps));
}

void rememberPendingApsAck(uint16_t destinationShort,
                           const ZigbeeApsDataFrame& aps,
                           const uint8_t* payload, uint8_t payloadLength) {
  if (aps.deliveryMode != kZigbeeApsDeliveryUnicast || !aps.ackRequested ||
      payloadLength > sizeof(g_pendingApsAck.payload) ||
      (payloadLength > 0U && payload == nullptr)) {
    clearPendingApsAck();
    return;
  }
  g_pendingApsAck.active = true;
  g_pendingApsAck.destinationShort = destinationShort;
  g_pendingApsAck.counter = aps.counter;
  g_pendingApsAck.clusterId = aps.clusterId;
  g_pendingApsAck.profileId = aps.profileId;
  g_pendingApsAck.destinationEndpoint = aps.destinationEndpoint;
  g_pendingApsAck.sourceEndpoint = aps.sourceEndpoint;
  g_pendingApsAck.retriesRemaining = kApsAckRetryLimit;
  g_pendingApsAck.payloadLength = payloadLength;
  if (payloadLength > 0U) {
    memcpy(g_pendingApsAck.payload, payload, payloadLength);
  }
  g_pendingApsAck.deadlineMs = millis() + kApsAckTimeoutMs;
}

bool matchesPendingApsAck(const ZigbeeApsAcknowledgementFrame& ack,
                          uint16_t sourceShort) {
  return g_pendingApsAck.active && ack.valid && !ack.ackFormatCommand &&
         sourceShort == g_pendingApsAck.destinationShort &&
         ack.counter == g_pendingApsAck.counter &&
         ack.clusterId == g_pendingApsAck.clusterId &&
         ack.profileId == g_pendingApsAck.profileId &&
         ack.destinationEndpoint == g_pendingApsAck.sourceEndpoint &&
         ack.sourceEndpoint == g_pendingApsAck.destinationEndpoint;
}

void rememberRecentInboundAps(uint16_t sourceShort,
                              const ZigbeeApsDataFrame& aps) {
  g_recentInboundAps.valid = true;
  g_recentInboundAps.sourceShort = sourceShort;
  g_recentInboundAps.counter = aps.counter;
  g_recentInboundAps.clusterId = aps.clusterId;
  g_recentInboundAps.profileId = aps.profileId;
  g_recentInboundAps.destinationEndpoint = aps.destinationEndpoint;
  g_recentInboundAps.sourceEndpoint = aps.sourceEndpoint;
  g_recentInboundAps.deliveryMode = aps.deliveryMode;
  g_recentInboundAps.expiresMs = millis() + kRecentInboundApsWindowMs;
}

bool isRecentInboundApsDuplicate(uint16_t sourceShort,
                                 const ZigbeeApsDataFrame& aps,
                                 uint32_t nowMs) {
  if (!g_recentInboundAps.valid ||
      static_cast<int32_t>(nowMs - g_recentInboundAps.expiresMs) >= 0) {
    clearRecentInboundAps();
    return false;
  }
  return g_recentInboundAps.sourceShort == sourceShort &&
         g_recentInboundAps.counter == aps.counter &&
         g_recentInboundAps.clusterId == aps.clusterId &&
         g_recentInboundAps.profileId == aps.profileId &&
         g_recentInboundAps.destinationEndpoint == aps.destinationEndpoint &&
         g_recentInboundAps.sourceEndpoint == aps.sourceEndpoint &&
         g_recentInboundAps.deliveryMode == aps.deliveryMode;
}

bool sendNwkCommand(uint16_t destinationShort, const uint8_t* payload,
                    uint8_t payloadLength) {
  if (!g_joined || payload == nullptr || payloadLength == 0U) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kCommand;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = g_localShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kIeeeAddress;
    security.keySequence = g_activeNetworkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, g_activeNetworkKey,
                                              payload, payloadLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, payload, payloadLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, g_panId,
                                        destinationShort, g_localShort, nwkFrame,
                                        nwkLength, psdu, &psduLength, false)) {
    return false;
  }

  return g_radio.transmit(psdu, psduLength, false, 1200000UL);
}

bool sendApsFrameWithCounter(uint16_t destinationShort,
                             uint8_t destinationEndpoint, uint16_t clusterId,
                             uint16_t profileId, uint8_t sourceEndpoint,
                             const uint8_t* payload, uint8_t payloadLength,
                             uint8_t apsCounterValue, bool trackAck) {
  if (!g_joined) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

  ZigbeeApsDataFrame aps{};
  aps.frameType = ZigbeeApsFrameType::kData;
  aps.deliveryMode = kZigbeeApsDeliveryUnicast;
  aps.ackRequested = true;
  aps.destinationEndpoint = destinationEndpoint;
  aps.clusterId = clusterId;
  aps.profileId = profileId;
  aps.sourceEndpoint = sourceEndpoint;
  aps.counter = apsCounterValue;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataFrame(aps, payload, payloadLength, apsFrame,
                                      &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = g_localShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kIeeeAddress;
    security.keySequence = g_activeNetworkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, g_activeNetworkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, g_panId,
                                        destinationShort, g_localShort, nwkFrame,
                                        nwkLength, psdu, &psduLength, false)) {
    return false;
  }

