lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaDimmableLightJoinable/ZigbeeHaDimmableLightJoinable.ino
  const bool sent = g_radio.transmit(psdu, psduLength, false, 1200000UL);
  if (sent && trackAck) {
    rememberPendingApsAck(destinationShort, aps, payload, payloadLength);
  }
  return sent;
}

bool resendPendingApsFrame() {
  if (!g_pendingApsAck.active) {
    return false;
  }
  const bool sent = sendApsFrameWithCounter(
      g_pendingApsAck.destinationShort, g_pendingApsAck.destinationEndpoint,
      g_pendingApsAck.clusterId, g_pendingApsAck.profileId,
      g_pendingApsAck.sourceEndpoint, g_pendingApsAck.payload,
      g_pendingApsAck.payloadLength, g_pendingApsAck.counter, false);
  if (sent) {
    g_pendingApsAck.deadlineMs = millis() + kApsAckTimeoutMs;
  }
  return sent;
}

void maybeExpirePendingApsAck(uint32_t nowMs) {
  if (!g_pendingApsAck.active ||
      static_cast<int32_t>(nowMs - g_pendingApsAck.deadlineMs) < 0) {
    return;
  }
  if (g_pendingApsAck.retriesRemaining > 0U) {
    --g_pendingApsAck.retriesRemaining;
    const bool resent = resendPendingApsFrame();
    Serial.print("aps_ack retry ctr=0x");
    Serial.print(g_pendingApsAck.counter, HEX);
    Serial.print(" cluster=0x");
    Serial.print(g_pendingApsAck.clusterId, HEX);
    Serial.print(" remaining=");
    Serial.print(g_pendingApsAck.retriesRemaining);
    Serial.print(" sent=");
    Serial.print(resent ? "yes" : "no");
    Serial.print("\r\n");
    if (resent) {
      return;
    }
  }

  Serial.print("aps_ack miss ctr=0x");
  Serial.print(g_pendingApsAck.counter, HEX);
  Serial.print(" cluster=0x");
  Serial.print(g_pendingApsAck.clusterId, HEX);
  Serial.print("\r\n");
  clearPendingApsAck();
}

bool sendApsAcknowledgement(uint16_t destinationShort,
                            const ZigbeeApsDataFrame& request) {
  if (!g_joined || request.deliveryMode != kZigbeeApsDeliveryUnicast ||
      !request.ackRequested) {
    return false;
  }
  const bool useSecurity = g_securityEnabled && g_haveActiveNetworkKey;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  if (!ZigbeeCodec::buildApsDataAcknowledgement(request, apsFrame,
                                                &apsLength)) {
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = useSecurity;
  nwk.destinationShort = destinationShort;
  nwk.sourceShort = g_localShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  if (useSecurity) {
    ZigbeeNwkSecurityHeader security{};
    security.valid = true;
    security.securityControl = kZigbeeSecurityControlNwkEncMic32;
    security.frameCounter = g_nwkSecurityFrameCounter++;
    security.sourceIeee = kIeeeAddress;
    security.keySequence = g_activeNetworkKeySequence;
    if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, g_activeNetworkKey,
                                              apsFrame, apsLength, nwkFrame,
                                              &nwkLength)) {
      return false;
    }
  } else if (!ZigbeeCodec::buildNwkFrame(nwk, apsFrame, apsLength, nwkFrame,
                                         &nwkLength)) {
    return false;
  }

  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, g_panId,
                                        destinationShort, g_localShort, nwkFrame,
                                        nwkLength, psdu, &psduLength, false)) {
    return false;
  }

  return g_radio.transmit(psdu, psduLength, false, 1200000UL);
}

bool sendApsFrame(uint16_t destinationShort, uint8_t destinationEndpoint,
                  uint16_t clusterId, uint16_t profileId,
                  uint8_t sourceEndpoint, const uint8_t* payload,
                  uint8_t payloadLength) {
  return sendApsFrameWithCounter(destinationShort, destinationEndpoint,
                                 clusterId, profileId, sourceEndpoint, payload,
                                 payloadLength, g_apsCounter++, true);
}

bool sendEndDeviceTimeoutRequest() {
  refreshCommissioningState();
  if (!ZigbeeCommissioning::shouldRequestEndDeviceTimeout(g_network)) {
    return false;
  }

  uint8_t command[8] = {0U};
  uint8_t commandLength = 0U;
  if (!ZigbeeCodec::buildNwkEndDeviceTimeoutRequestCommand(
          g_network.endDeviceTimeoutIndex, g_network.endDeviceConfiguration,
          command, &commandLength)) {
    return false;
  }

  return sendNwkCommand(g_parentShort, command, commandLength);
}

bool sendDeviceAnnounce() {
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!g_device.buildDeviceAnnounce(g_zdoSequence++, payload, &payloadLength)) {
    return false;
  }
  return sendApsFrame(g_parentShort, 0U, kZigbeeZdoDeviceAnnounce,
                      kZigbeeProfileZdo, 0U, payload, payloadLength);
}

bool sendAttributeReport(uint16_t clusterId) {
  uint8_t zclFrame[127] = {0U};
  uint8_t zclLength = 0U;
  if (!g_device.buildAttributeReport(clusterId, g_zclSequence++, zclFrame,
                                     &zclLength) ||
      zclLength == 0U) {
    return false;
  }

  uint64_t destinationIeee = 0U;
  uint8_t destinationEndpoint = kCoordinatorEndpoint;
  if (g_device.resolveBindingDestination(kLocalEndpoint, clusterId,
                                         &destinationIeee,
                                         &destinationEndpoint) &&
      destinationEndpoint != 0U) {
    return sendApsFrame(g_parentShort, destinationEndpoint, clusterId,
                        kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame,
                        zclLength);
  }
  return sendApsFrame(g_parentShort, kCoordinatorEndpoint, clusterId,
                      kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame,
                      zclLength);
}

bool sendDueAttributeReport(uint32_t nowMs, uint16_t* outClusterId) {
  if (outClusterId != nullptr) {
    *outClusterId = 0U;
  }

  uint8_t zclFrame[127] = {0U};
  uint8_t zclLength = 0U;
  uint16_t clusterId = 0U;
  if (!g_device.buildDueAttributeReport(nowMs, g_zclSequence++, &clusterId,
                                        zclFrame, &zclLength) ||
      zclLength == 0U) {
    return false;
  }

  uint64_t destinationIeee = 0U;
  uint8_t destinationEndpoint = kCoordinatorEndpoint;
  bool ok = false;
  if (g_device.resolveBindingDestination(kLocalEndpoint, clusterId,
                                         &destinationIeee,
                                         &destinationEndpoint) &&
      destinationEndpoint != 0U) {
    ok = sendApsFrame(g_parentShort, destinationEndpoint, clusterId,
                      kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame,
                      zclLength);
  } else {
    ok = sendApsFrame(g_parentShort, kCoordinatorEndpoint, clusterId,
                      kZigbeeProfileHomeAutomation, kLocalEndpoint, zclFrame,
                      zclLength);
  }

  if (!ok) {
    g_device.discardDueAttributeReport();
    return false;
  }

