lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaDimmableLightJoinable/ZigbeeHaDimmableLightJoinable.ino
  (void)g_device.commitDueAttributeReport(nowMs);
  if (outClusterId != nullptr) {
    *outClusterId = clusterId;
  }
  return true;
}

bool handleApsCommand(const uint8_t* frame, uint8_t length, uint16_t sourceShort,
                      uint64_t securedSourceIeee, bool nwkSecured) {
  refreshCommissioningState();

  uint8_t installCodeKey[16] = {0U};
  const bool haveInstallCodeKey = loadInstallCodeLinkKey(installCodeKey);
  ZigbeeTransportKeyInstallResult transportInstall{};
  if (ZigbeeCommissioning::acceptTransportKeyCommand(
          g_network, kIeeeAddress, frame, length, installCodeKey,
          haveInstallCodeKey, &transportInstall)) {
    ZigbeeCommissioning::applyTransportKeyInstall(&g_network, transportInstall);
    if (transportInstall.activatesNetworkKey) {
      g_lastInboundSecurityFrameCounter = 0U;
    }
    persistState();
    if (transportInstall.stagesAlternateKey) {
      Serial.print("transport_key_update seq=");
    } else if (transportInstall.refreshesAlternateKey) {
      Serial.print("transport_key_update_refresh seq=");
    } else {
      Serial.print("transport_key seq=");
    }
    Serial.print(transportInstall.transportKey.keySequence);
    Serial.print(" install=");
    if (transportInstall.activatesNetworkKey) {
      Serial.print("active");
    } else if (transportInstall.stagesAlternateKey) {
      Serial.print("staged");
    } else if (transportInstall.refreshesActiveNetworkKey) {
      Serial.print("active_refresh");
    } else if (transportInstall.refreshesAlternateKey) {
      Serial.print("staged_refresh");
    } else {
      Serial.print("noop");
    }
    Serial.print(" tc=0x");
    Serial.print(static_cast<uint32_t>(g_trustCenterIeee >> 32U), HEX);
    Serial.print(static_cast<uint32_t>(g_trustCenterIeee & 0xFFFFFFFFUL), HEX);
    Serial.print(" lk=");
    Serial.print(ZigbeeCommissioning::keyModeName(g_preconfiguredKeyMode));
    Serial.print(" ctr=");
    Serial.print(transportInstall.counter);
    if (transportInstall.apsSecurity.valid) {
      Serial.print(" aps_sec_fc=");
      Serial.print(transportInstall.apsSecurity.frameCounter);
    }
    Serial.print("\r\n");
    if (transportInstall.activatesNetworkKey) {
      (void)sendDeviceAnnounce();
      (void)sendEndDeviceTimeoutRequest();
    }
    return true;
  }

  ZigbeeUpdateDeviceAcceptance updateDevice{};
  if (ZigbeeCommissioning::acceptUpdateDeviceCommand(
          g_network, kIeeeAddress, sourceShort, securedSourceIeee, nwkSecured,
#if NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS
          true,
#else
          false,
#endif
          frame, length, installCodeKey, haveInstallCodeKey, &updateDevice)) {
    ZigbeeCommissioning::applyUpdateDevice(&g_network, updateDevice);
    if (updateDevice.updateDevice.status ==
        kZigbeeApsUpdateDeviceStatusStandardSecureRejoin) {
      configureDeviceForCurrentNetwork();
      applyLedState();
      persistState();
      (void)sendDeviceAnnounce();
      (void)sendEndDeviceTimeoutRequest();
    }
    Serial.print("update_device short=0x");
    Serial.print(updateDevice.updateDevice.deviceShort, HEX);
    Serial.print(" status=0x");
    Serial.print(updateDevice.updateDevice.status, HEX);
    Serial.print(" nwk_sec=");
    Serial.print(nwkSecured ? "1" : "0");
    if (updateDevice.apsSecurity.valid) {
      Serial.print(" aps_sec_fc=");
      Serial.print(updateDevice.apsSecurity.frameCounter);
    }
    Serial.print("\r\n");
    return true;
  }

  ZigbeeSwitchKeyAcceptance switchKey{};
  if (ZigbeeCommissioning::acceptSwitchKeyCommand(
          g_network, sourceShort, securedSourceIeee, nwkSecured, false, frame,
          length, installCodeKey, haveInstallCodeKey, &switchKey)) {
    ZigbeeCommissioning::applySwitchKey(&g_network, switchKey);
    g_lastInboundSecurityFrameCounter = 0U;
    configureDeviceForCurrentNetwork();
    applyLedState();
    persistState();
    Serial.print("switch_key seq=");
    Serial.print(g_activeNetworkKeySequence);
    Serial.print(" ctr=");
    Serial.print(switchKey.counter);
    if (switchKey.apsSecurity.valid) {
      Serial.print(" aps_sec_fc=");
      Serial.print(switchKey.apsSecurity.frameCounter);
    }
    Serial.print("\r\n");
    return true;
  }

  return false;
}

bool activeScan(ScanResult* outResult) {
  if (outResult == nullptr) {
    return false;
  }
  memset(outResult, 0, sizeof(*outResult));
  refreshCommissioningState();
  ZigbeeBeaconCandidate candidate{};
  if (!ZigbeeCommissioning::activeScan(g_radio, &g_macSequence, &g_network,
                                       &candidate) ||
      !candidate.valid) {
    return false;
  }

  outResult->valid = candidate.valid;
  outResult->channel = candidate.channel;
  outResult->rssiDbm = candidate.rssiDbm;
  outResult->score = candidate.score;
  outResult->beacon = candidate.beacon;
  return true;
}

bool waitForAssociationResponse(uint16_t* outAssignedShort) {
  if (outAssignedShort == nullptr) {
    return false;
  }

  const uint32_t deadline = millis() + 1500U;
  while (static_cast<int32_t>(millis() - deadline) < 0) {
    uint8_t pollFrame[127] = {0U};
    uint8_t pollLength = 0U;
    if (!ZigbeeCodec::buildDataRequest(g_macSequence++, g_panId, g_parentShort,
                                       kIeeeAddress, pollFrame, &pollLength)) {
      return false;
    }
    (void)g_radio.transmit(pollFrame, pollLength, false, 1200000UL);

    const uint32_t listenDeadline = millis() + 90U;
    while (static_cast<int32_t>(millis() - listenDeadline) < 0) {
      ZigbeeFrame frame{};
      if (!g_radio.receive(&frame, 5000U, 350000UL)) {
        continue;
      }

      ZigbeeMacAssociationResponseView response{};
      if (!ZigbeeCodec::parseAssociationResponse(frame.psdu, frame.length,
                                                 &response) ||
          !response.valid ||
          response.destinationExtended != kIeeeAddress ||
          response.panId != g_panId || response.status != 0x00U) {
        continue;
      }

      *outAssignedShort = response.assignedShort;
      return true;
    }

