lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaDimmableLightJoinable/ZigbeeHaDimmableLightJoinable.ino
    delay(25);
  }

  return false;
}

bool performJoin() {
  refreshCommissioningState();
  if (!ZigbeeCommissioning::performJoin(g_radio, &g_macSequence, kIeeeAddress,
                                        0xCCU, &g_network)) {
    return false;
  }
  configureDeviceForCurrentNetwork();
  applyLedState();
  persistState();
  return true;
}

bool performSecureRejoin() {
  refreshCommissioningState();
  if (!ZigbeeCommissioning::performSecureRejoin(
          g_radio, &g_macSequence, kIeeeAddress, 0xCCU, &g_network)) {
    return false;
  }
  configureDeviceForCurrentNetwork();
  applyLedState();
  persistState();
  return true;
}

void processIncomingFrame(const ZigbeeFrame& frame) {
  ZigbeeDataFrameView macData{};
  if (!ZigbeeRadio::parseDataFrameShort(frame.psdu, frame.length, &macData) ||
      !macData.valid || macData.panId != g_panId ||
      macData.destinationShort != g_localShort) {
    return;
  }

  ZigbeeNetworkFrame nwk{};
  ZigbeeNwkSecurityHeader security{};
  uint8_t decryptedPayload[127] = {0U};
  uint8_t decryptedPayloadLength = 0U;
  bool nwkValid = false;
  const bool requireSecuredNwk = g_haveActiveNetworkKey || g_securityEnabled;
  if (g_haveActiveNetworkKey) {
    nwkValid = ZigbeeSecurity::parseSecuredNwkFrame(
        macData.payload, macData.payloadLength, g_activeNetworkKey, &nwk,
        &security, decryptedPayload, &decryptedPayloadLength);
    const uint64_t expectedTc = expectedTrustCenterIeee();
    if (nwkValid &&
        (!security.valid ||
         (expectedTc != 0U && security.sourceIeee != expectedTc) ||
         security.keySequence != g_activeNetworkKeySequence ||
         security.frameCounter <= g_lastInboundSecurityFrameCounter)) {
      return;
    }
  }
  if (!nwkValid && !requireSecuredNwk) {
    nwkValid =
        ZigbeeCodec::parseNwkFrame(macData.payload, macData.payloadLength, &nwk);
  }
  if (!nwkValid || !nwk.valid || nwk.destinationShort != g_localShort) {
    return;
  }
  if (security.valid) {
    g_lastInboundSecurityFrameCounter = security.frameCounter;
  }

  if (nwk.frameType == ZigbeeNwkFrameType::kCommand) {
    ZigbeeNwkEndDeviceTimeoutResponse timeoutResponse{};
    if (ZigbeeCommissioning::acceptEndDeviceTimeoutResponse(
            g_network, nwk.payload, nwk.payloadLength, &timeoutResponse)) {
      ZigbeeCommissioning::applyEndDeviceTimeoutResponse(&g_network,
                                                         timeoutResponse);
      persistState();
      Serial.print("end_device_timeout status=0x");
      Serial.print(timeoutResponse.status, HEX);
      Serial.print(" parent_info=0x");
      Serial.print(timeoutResponse.parentInformation, HEX);
      Serial.print(" poll_ms=");
      Serial.print(g_parentPollIntervalMs);
      Serial.print("\r\n");
    }
    return;
  }

  ZigbeeApsDataFrame aps{};
  ZigbeeApsAcknowledgementFrame ack{};
  if (ZigbeeCodec::parseApsAcknowledgementFrame(nwk.payload, nwk.payloadLength,
                                                &ack) &&
      ack.valid) {
    if (matchesPendingApsAck(ack, nwk.sourceShort)) {
      Serial.print("aps_ack rx ctr=0x");
      Serial.print(ack.counter, HEX);
      Serial.print(" cluster=0x");
      Serial.print(ack.clusterId, HEX);
      Serial.print("\r\n");
      clearPendingApsAck();
    }
    return;
  }
  if (!ZigbeeCodec::parseApsDataFrame(nwk.payload, nwk.payloadLength, &aps) ||
      !aps.valid) {
    (void)handleApsCommand(nwk.payload, nwk.payloadLength, nwk.sourceShort,
                           security.valid ? security.sourceIeee : 0U,
                           security.valid);
    return;
  }

  const uint32_t nowMs = millis();
  const bool duplicateAps =
      isRecentInboundApsDuplicate(nwk.sourceShort, aps, nowMs);

  if (aps.profileId == kZigbeeProfileZdo) {
    if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
      (void)sendApsAcknowledgement(nwk.sourceShort, aps);
    }
    if (duplicateAps) {
      Serial.print("aps_dup cluster=0x");
      Serial.print(aps.clusterId, HEX);
      Serial.print(" src=0x");
      Serial.print(nwk.sourceShort, HEX);
      Serial.print("\r\n");
      return;
    }
    rememberRecentInboundAps(nwk.sourceShort, aps);
    uint16_t responseClusterId = 0U;
    uint8_t responsePayload[127] = {0U};
    uint8_t responseLength = 0U;
    if (g_device.handleZdoRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                  &responseClusterId, responsePayload,
                                  &responseLength) &&
        responseLength > 0U) {
      (void)sendApsFrame(nwk.sourceShort, 0U, responseClusterId,
                         kZigbeeProfileZdo, 0U, responsePayload, responseLength);
      uint8_t leaveFlags = 0U;
      if (g_device.consumeLeaveRequest(&leaveFlags)) {
        handleAcceptedLeaveRequest(leaveFlags);
      }
    }
    return;
  }

  const bool targetsLocalEndpoint =
      (aps.deliveryMode == kZigbeeApsDeliveryUnicast &&
       aps.destinationEndpoint == kLocalEndpoint) ||
      (aps.deliveryMode == kZigbeeApsDeliveryGroup &&
       g_device.isInGroup(aps.destinationGroup));
  if (aps.profileId != kZigbeeProfileHomeAutomation || !targetsLocalEndpoint) {
    return;
  }
  if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
    (void)sendApsAcknowledgement(nwk.sourceShort, aps);
  }
  if (duplicateAps) {
    Serial.print("aps_dup cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" src=0x");
    Serial.print(nwk.sourceShort, HEX);
    Serial.print("\r\n");
    return;
  }
  rememberRecentInboundAps(nwk.sourceShort, aps);

  uint8_t responseFrame[127] = {0U};
  uint8_t responseLength = 0U;
  if (!g_device.handleZclRequest(aps.clusterId, aps.payload, aps.payloadLength,
                                 responseFrame, &responseLength)) {
    return;
  }

  g_savedOnOffState = g_device.onOff();
  g_savedLevelState = g_device.level();
  applyLedState();
  persistState();
  Serial.print("zcl cluster=0x");
  Serial.print(aps.clusterId, HEX);
  Serial.print(" onoff=");
  Serial.print(g_device.onOff() ? "ON" : "OFF");
  Serial.print(" level=");
  Serial.print(g_device.level());
  Serial.print("\r\n");

